Tekla Open API Reference for Tekla Structures 2025
StructuresDialogFilterAttribute Properties
The StructuresDialogFilterAttribute type exposes the following members.
Properties
Name | Description
AttributeName
 Gets the attribute name of the property.
Top
See Also
Reference
StructuresDialogFilterAttribute Class
Tekla.Structures.Dialog Namespace